app/controllers/prototypes_controller.rb

  def index
    @prototypes = Prototype.all
---
SELECT `prototypes`.* FROM `prototypes`

  def create
    @prototype = Prototype.new(prototype_params)
    if @prototype.save
---
INSERT INTO `prototypes` (`title`, `catch_copy`, `concept`, `user_id`, `created_at`, `updated_at`) VALUES ('test', 'TESTTEST', 'TESTTEST', 1, '2018-02-15 00:33:11', '2018-02-15 00:33:11')

  def set_prototype
    @prototype = Prototype.find(params[:id])
---
SELECT  `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1